package by.home.mod1.cycles;

import java.util.Scanner;

//Напишите программу, где пользователь вводит любое целое положительное число. А программа суммирует
//все числа от 1 до введенного пользователем числа.


public class Cycles1 {

	public static void main(String[] args) {

		int x;
		int y;
		Scanner s = new Scanner(System.in);
		System.out.println("Введите целое положительное число: ");
		x = s.nextInt();
<<<<<<< HEAD
		s.close();
		
		
=======
<<<<<<< HEAD
		s.close();
		
		
=======
>>>>>>> branch 'master' of https://github.com/caveks/IntroductionToJavaOnline.git
>>>>>>> branch 'master' of https://github.com/caveks/IntroductionToJavaOnline.git

	}

}
